# Переменная —  это именованная ссылка, ведущая на объект в памяти
#Имя переменной: может состоять из символов латиницы, цифр и знака нижнего подчеркивания
#                должно отличаться от наименований встроенных в Python служебных слов
#                не может содержать пробелов
# Отметьте символы, которые могут входить в имя переменной: R _ a 2
# Выберите только корректные имена переменных: AGE, Denis1996, Leo,his_name
# Сопоставьте наименования типов данных с их описанием: str  строковый тип данных
#                                                       int  целочисленный тип данных
# Выберите только верные варианты инициализации переменной: b = 7 + 4 , surname = "Ivanov" , num = 50 , full_name = "Leonid Shastin"
# Переменная z после выполнения приведенного ниже кода будет ссылаться на : 12
# Выберите только верные варианты множественного и каскадного присваивания: surname, age = "Bakhtiev", 28 ; a = b = c = 1 ; w, x, y = 2, 7, 14
#Переменные a и b после исполнения приведенного ниже кода будут ссылаться на: одинаковые объекты в памяти
#На какое значение будет ссылаться переменная num после исполнения следующего кода? 7
#На какое значение будет ссылаться переменная num после исполнения следующего кода? 17
#На какое значение будет ссылаться переменная result после исполнения приведенного ниже кода? 10
#Какие кавычки можно использовать для создания строк? двойные , одинарные
#На какую строку будет ссылаться переменная result после исполнения приведенного ниже кода? Denis Shastin

