#Функция print() используется для : вывода данных на экран

#Дана программа:
# name = "Leonid"
# a = 10
# Выберите корректные варианты использования функции print(): print(a) print("world") print(20, a) print(50) print(60, 40, "main") print(name)


# Что выведет приведенный ниже код?  70 100
# num = 50
# print(num + 20, 100)

# Что выведет приведенный ниже код? name
# name = "Ledenis"
# print("name")


# Что выведет приведенный ниже код? Leonid&Denis
# print("Leonid", "Denis", sep="&")

# Что выведет приведенный ниже код? 
#                                               C#?C++!!Java
#                                               Pascal!!!
# print('C#', end='?')
# print('C++', 'Java', sep='!!', end='\n')
# print('Pascal!!!')


# Напишите программу, которая выводит на экран следующий текст:
# Вперёд к сотке!
# Примечание. Результат вывода должен точно соответствовать приведенному выше тексту.
# print ("Вперёд"+" "+"к"+" "+"сотке"+"!")


# Допишите приведённую ниже программу так, чтобы она выводила:
# Leonid Bakhtiev
# name = "Leonid"
# surname = "Bakhtiev"
# print (name + " " + surname)


# Напишите программу, которая последовательно в одну строку выводит числа от 5 до 10, разделяя их знаком !, а затем без переноса строки выводит те же числа в обратном порядке, разделяя их знаком ?:
# 5!6!7!8!9!1010?9?8?7?6?5
# Примечание. Используйте дополнительные параметры sep и end.
# print(5, 6, 7, 8, 9, 10, sep='!', end='')
# print(10, 9, 8, 7, 6, 5, sep = '?', end='')


# Функция input() используется для: ввода данных с клавиатуры


# Соотнесите наименования функций с их назначением
#                             int()     преобразует объект к целому типу
#                             str()     преобразует объект к строковому типу
#                             type()    определяет тип данных, к которому принадлежит объект




# Напишите программу, которая принимает на вход два натуральных числа и выводит на экран значение их произведения.
# Примечание. Каждое число вводится с новой строки через input().
# a = int(input())
# b = int(input())
# print (a*b)



# Напишите программу, которая принимает на вход имя человека и выводит приветствие в формате:
# Здравствуйте, <имя человека>
# name = str(input())
# print ("Здравствуйте," + ' '+ name)


# Напишите программу, которая принимает на вход три строки через input():
# имя ученика
# название экзамена (в предложном падеже)
# количество баллов
# И выводит на экран информацию о количестве баллов, набранных учеником за экзамен в следующем виде:
# <имя ученика> набрал <количество баллов> баллов на экзамене по <название экзамена>!
# name = str(input())
# sabj = str(input())
# ball = str(input())
# print (name + ' ' + "набрал" + ' ' + ball + ' '+ "баллов на экзамене по" + ' ' + sabj +"!" )
