# Сколько итераций будет выполнено в результате выполнения приведённой ниже программы? 8
# a = 8
# for i in range(a):
#     print(a ** 2)




# Что будет выведено в результате выполнения приведённой ниже программы? 0 1 2 3 4
# for i in range(5):
#     print(i, end=' ')




# Что будет выведено в результате выполнения приведённой ниже программы? 2 3 4 5 6 7 8
# for i in range(2, 9):
#     print(i, end=' ')



# Что будет выведено в результате выполнения приведённой ниже программы? 21
# s = 0
# for num in range(1, 7):
#     s += num
# print(s)





# Что будет выведено в результате выполнения приведённой ниже программы? 4 9 15 22 30
# s = 0
# for num in range(4, 9):
#     s += num
#     print(s, end=' ')




# Что будет выведено в результате выполнения приведённой ниже программы? 6
# s = 0
# for num in range(2, 6):
#     if num % 2 == 0:
#         s += num
# print(s)






# Что будет выведено в результате выполнения приведённой ниже программы? 28
# p = 1
# for num in range(1, 10, 3):
#     p *= num
# print(p)




# Сколько чисел будет выведено на экран в результате выполнения приведённой ниже программы? 5
# for num in range(2, 50, 5):
#     if num % 10 == 7:
#         print(num)





# Что будет выведено на экран в результате выполнения приведённой ниже программы?   Ничего
# for num in range(7, 22, -4):
#     print(num, end=' ')





# Что будет выведено на экран в результате выполнения приведённой ниже программы? 53 48 43
# for num in range(53, 38, -5):
#     print(num, end=' ')



# то будет выведено на экран в результате выполнения приведённой ниже программы?  55
# s = 0
# for num in range(13, 1, -3):
#     if s % 2 == 0:
#         s += num
#     else:
#         s += num * 2
# print(s)



# Что будет выведено на экран в результате выполнения приведённой ниже программы?  28
# for i in range(19, 1000):
#     if i % 2 == 0 and i % 7 == 0:
#         print(i)
#         break



# Сколько чётных чисел будет выведено при выполнении следующей программы? 6
# for i in range(10, 100):
#     if i >= 22:
#         break
#     print(i)