# Списки в Python являются изменяемыми объектами



# Элементами списков могут являться объекты
# типа данных int
# типа данных list
# типа данных float
# типа данных str





# Выберите все правильные способы создания пустого списка
# a = list()
# a = []



# Что выведет приведённый ниже код?   [2, 3, 1, 1]
# a = [1, 1]
# b = [2, 3]
# c = b + a
# print(c)



# Что выведет приведённый ниже код?     False
# a = [2, 7]
# b = [7, 2]
# print(a == b)



# Что выведет приведённый ниже код?     [3, 3, 3, 3, 3, 3]
# a = [3, 3]
# a *= 3
# print(a)



# Что выведет приведённый ниже код? 3
# values = [5, 4, 3, 2, 1]
# print(sum(values) // len(values))



# Что выведет приведённый ниже код?   100
# numbers = [75, 50, 60, 25, 37]
# print(max(numbers) + min(numbers))








# Что выведет приведённый ниже код? 100
# numbers = [15, 50, 160, 10, 35]
# print(sum(numbers) - max(numbers) - min(numbers))




# Что выведет приведённый ниже код?     True
# a = [2, 7, 9]
# print(9 in a)



# Что выведет приведённый ниже код?     False
# a = [13, 19, 16]
# print(19 not in a)











# Допишите программу так, чтобы она вывела результат конкатенации списков a и b.
# Выходные данные
# Выведите одно значение — результат конкатенации двух списков.
# a = [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
# b = [19, 18, 17, 16, 15, 14, 13, 12, 11, 10]
# print(a+b)





# Напишите программу, которая создает список, содержащий n нулей, и выводит его на экран.
# Входные данные
# На вход подаётся произвольное одно натуральное число n.
# Выходные данные
# Выведите одно значение — список, состоящий из n нулей.
# Sample Input:
# 5
# Sample Output:
# [0, 0, 0, 0, 0]
# a = int(input())
# print([0] * a)





# Допишите программу так, чтобы она вывела сумму максимального и минимального элементов списка measurements.
# Выходные данные
# Выведите одно число — сумму максимального и минимального значений исходного списка.
# measurements = [79.6, 3.304, -243.255, 14.993, -38.272, -364.249, 106.608, 274.66, -558.013, 449.848, -671.302, -65.573, -789.216, 419.364, -184.53, -107.232, -93.056, 56.259, -64.598, -564.206, -385.525, 440.756, 514.715, 232.408, 342.797, 275.741, -5.129, -20.54, 473.77, -94.308, -155.675, -90.878, -391.21, 149.588, 253.079, -125.675, 510.328, -37.36, -138.765, -106.132, -38.96, 7.504, -14.978, -86.054, 96.39, -62.81, -64.713, 112.126, -882.377, -359.257, -19.793, 594.963, -246.173, -86.212, 676.782, -201.945, 8.393, 788.964, 28.015, 221.096, 47.9, 218.384, -546.786, -71.577, 745.429, 141.596, 277.795, 33.573, -9.96, -201.05, -232.944, 223.9, -170.578, 960.785, 8.708, -192.103, 136.37, -38.501, 694.116, 252.185, -248.279, -184.596, -4.698, -502.464, 443.522, -476.864, -624.856, 130.076, 415.534, 486.808, -12.248, 272.836, 11.402, 369.041, 31.358, -0.332, 113.602, 114.217, -272.035, 260.446]
# print(min(measurements) + max(measurements))







# Допишите программу так, чтобы она вывела среднее арифметическое всех элементов списка measurements, не являющихся максимальным и минимальным значениями.
# Выходные данные
# Выведите одно число — среднее арифметическое всех элементов списка measurements, кроме максимального и минимального.
# measurements = [79.6, 3.304, -243.255, 14.993, -38.272, -364.249, 106.608, 274.66, -558.013, 449.848, -671.302, -65.573, -789.216, 419.364, -184.53, -107.232, -93.056, 56.259, -64.598, -564.206, -385.525, 440.756, 514.715, 232.408, 342.797, 275.741, -5.129, -20.54, 473.77, -94.308, -155.675, -90.878, -391.21, 149.588, 253.079, -125.675, 510.328, -37.36, -138.765, -106.132, -38.96, 7.504, -14.978, -86.054, 96.39, -62.81, -64.713, 112.126, -882.377, -359.257, -19.793, 594.963, -246.173, -86.212, 676.782, -201.945, 8.393, 788.964, 28.015, 221.096, 47.9, 218.384, -546.786, -71.577, 745.429, 141.596, 277.795, 33.573, -9.96, -201.05, -232.944, 223.9, -170.578, 960.785, 8.708, -192.103, 136.37, -38.501, 694.116, 252.185, -248.279, -184.596, -4.698, -502.464, 443.522, -476.864, -624.856, 130.076, 415.534, 486.808, -12.248, 272.836, 11.402, 369.041, 31.358, -0.332, 113.602, 114.217, -272.035, 260.446]
# a = max(measurements)
# b = min(measurements)
# print (a , b)
# measurements = [79.6, 3.304, -243.255, 14.993, -38.272, -364.249, 106.608, 274.66, -558.013, 449.848, -671.302, -65.573, -789.216, 419.364, -184.53, -107.232, -93.056, 56.259, -64.598, -564.206, -385.525, 440.756, 514.715, 232.408, 342.797, 275.741, -5.129, -20.54, 473.77, -94.308, -155.675, -90.878, -391.21, 149.588, 253.079, -125.675, 510.328, -37.36, -138.765, -106.132, -38.96, 7.504, -14.978, -86.054, 96.39, -62.81, -64.713, 112.126,  -359.257, -19.793, 594.963, -246.173, -86.212, 676.782, -201.945, 8.393, 788.964, 28.015, 221.096, 47.9, 218.384, -546.786, -71.577, 745.429, 141.596, 277.795, 33.573, -9.96, -201.05, -232.944, 223.9, -170.578, 8.708, -192.103, 136.37, -38.501, 694.116, 252.185, -248.279, -184.596, -4.698, -502.464, 443.522, -476.864, -624.856, 130.076, 415.534, 486.808, -12.248, 272.836, 11.402, 369.041, 31.358, -0.332, 113.602, 114.217, -272.035, 260.446]
# print(sum(measurements) / len(measurements))
